Autodesk.Revit.DB.BaseLoadOn
An enumerated type listing all the possible power load use types for a space object.

Autodesk.Revit.DB.BaseLoadOn.kNoOfBaseLoadOnMethods
Return BaseLoadOn is NoOfBaseLoadOnMethods.

Autodesk.Revit.DB.BaseLoadOn.kUseActualLoad
Return BaseLoadOn is UseActualLoad.

Autodesk.Revit.DB.BaseLoadOn.kUseCalculatedLoad
Return BaseLoadOn is UseCalculatedLoad.

Autodesk.Revit.DB.BaseLoadOn.kUseEnteredLoad
Return BaseLoadOn is UseEnteredLoad.

Autodesk.Revit.DB.BaseLoadOn.kBySpaceType
Return BaseLoadOn is BySpaceType.

Autodesk.Revit.DB.BaseLoadOn.kUseDefaultLoad
Return BaseLoadOn is UseDefaultLoad. Obsoleted from 2018, use kBySpaceType instead.